import Typo from 'components/typography'
import { useTheme } from '@mui/material/styles'
import useMediaQuery from '@mui/material/useMediaQuery'

export const Medeesecond = () => {
  const theme = useTheme()
  const matches = useMediaQuery(theme.breakpoints.down('sm'))
  return (
    <div className="flex flex-col gap-8">
      <Typo variant={matches ? 'body-mobile' : 'h2'}>
        Д. Жанчив: Технологийн хөгжил бидний амьдралыг илүү хялбарчилна.
      </Typo>
      <Typo variant="body">
        Би технологийн салбарт 10 дахь жилдээ ажиллаж байна. Улс нийгэмдээ хэрэгтэй, хүний өдөр тутмын асуудлыг шийдэж
        чаддаг учраас технологи, программ хангамжийн салбарт ажиллахдаа урам зоригтой байдаг. Манай байгууллага өмнө нь
        төрийн албаны шалгалт өгөхөд туслах E-Test, унадаг дугуйны UBike зэрэг аппликейшнүүдийг хөгжүүлсэн туршлагатай.
        Төрийн болон бизнесийн байгууллагуудын дунд зэрэглэлийн системүүдэд төвлөрч ажиллаад 5 жил болж байна.
      </Typo>
      <Typo variant="body">
        Хамгийн сүүлд Сонгуулийн ерөнхий хороо, ЛИЙД төгсөгчдийн холбоотой хамтран сонгуулийн ирцийг 12 насны ангилал,
        газарзүйн байршлаар нарийвчилж харуулах гар утасны аппликейшнийг бүтээлээ. Өмнө нь сонгуулийн хэсгийн хороод
        утсаар ярих байдлаар мэдээллээ солилцдог байсан бол гар утасны аппликейшн нэвтэрснээр энэхүү үйл явц
        хялбарчлагдаж QR код уншуулан ирцийн мэдээгээ илгээх боломжтой юм. Бид нар аппликейшнээ сар орчмын хугацаанд
        хөгжүүлсэн. Аппликейшн маань дараах 3 дэд хэсгээс бүрдэнэ.{' '}
      </Typo>
      <Typo variant="body">
        Нэгдүгээрт, сонгуулийн дэд хэсэгт байрлаж байгаа ажилтнууд гар утсаараа ирцийн мэдээг СЕХ дээр байрлаж буй
        сервер рүү солилцож нэгтгэх боломжтой. Хоёрдугаарт, админ нь тэрхүү мэдээллийг 9-12 цаг тутам шинэчлэх, олон
        нийт нээлттэй ашиглах зэрэг гурван хэсэгтэй. Энэ удаагийн сонгуулиар аппликейшн, QR код ашиглан ирцийн мэдээг
        ийнхүү цуглуулж, харах болно. Мөн алслагдсан хэсгийн хороодын тухайд ойролцоо онлайн хэсгийн хороотойгоо
        холбогдон мэдээллээ серверт оруулах боломжтой. Жил ирэх тусам нийгэм даяараа программ хангамж, технологийн
        хөгжлийг илүү их ойлгодог болж байна. Цаашид энэ мэтчилэн технологийн хөгжил бидний амьдралыг илүү хялбарчилна
        гэж боддог. Сонгуулийн ирцийн аппликейшний тухайд захиалагч тал буюу Сонгуулийн ерөнхий хороо цаашдын
        хөгжүүлэлтийг хариуцах болно.
      </Typo>
    </div>
  )
}
